Repository: KiYouJyo/ApiMonitor
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Status.DataRecoveredTitle
source: Local data recovered
ja_jp: ローカルデータを復元しました
zh_cn: 本地数据已恢复

# Status.DataErrorTitle
source: Local data error
ja_jp: ローカルデータエラー
zh_cn: 本地数据错误

# Status.DataErrorCannotRead
source: Unable to read local data; the app will start with empty data.
ja_jp: ローカルデータを読み取れません。アプリは空のデータで起動します。
zh_cn: 无法读取本地数据，应用将继续以空数据启动。

# Status.AccountSavedTitle
source: Account saved
ja_jp: アカウントを保存しました
zh_cn: 账户已保存

# Status.AccountAddedMessage
source: Account "{0}" has been added.
ja_jp: アカウント「{0}」を追加しました。
zh_cn: 账户“{0}”已添加。

# Status.AccountUpdatedMessage
source: Account "{0}" has been updated.
ja_jp: アカウント「{0}」を更新しました。
zh_cn: 账户“{0}”已更新。

# Status.AccountSaveFailed
source: Failed to save account. Please try again later.
ja_jp: アカウントの保存に失敗しました。後でもう一度お試しください。
zh_cn: 保存账户失败，请稍后重试。

# Status.AccountDeletedTitle
source: Account deleted
ja_jp: アカウントを削除しました
zh_cn: 账户已删除

# Status.AccountDeletedMessage
source: Account "{0}" and its credentials, balance snapshots, and history have been deleted.
ja_jp: アカウント「{0}」とその資格情報、残高スナップショット、履歴を削除しました。
zh_cn: 账户“{0}”及其凭据、余额快照与历史记录已删除。

# Status.AccountDeleteFailed
source: Failed to delete account. Please try again later.
ja_jp: アカウントの削除に失敗しました。後でもう一度お試しください。
zh_cn: 删除账户失败，请稍后重试。

# Status.QueryInProgressTitle
source: Query in progress
ja_jp: 照会中
zh_cn: 查询进行中

# Status.QueryInProgressMessage
source: This account is being queried. Please wait.
ja_jp: このアカウントを照会しています。お待ちください。
zh_cn: 该账户正在查询，请稍候。

# Status.QuerySuccessTitle
source: Query succeeded
ja_jp: 照会に成功しました
zh_cn: 查询成功

# Status.QuerySuccessMessage
source: Balance for account "{0}" has been updated.
ja_jp: アカウント「{0}」の残高を更新しました。
zh_cn: 账户“{0}”的余额已更新。

# Status.QueryFailedTitle
source: Query failed
ja_jp: 照会に失敗しました
zh_cn: 查询失败

# Common.UnknownError
source: Unknown error.
ja_jp: 不明なエラーです。
zh_cn: 未知错误。

# Status.RefreshFailedTitle
source: Refresh failed
ja_jp: 更新に失敗しました
zh_cn: 刷新失败

# Status.RefreshFailedMessage
source: An error occurred while refreshing all accounts. Please try again later.
ja_jp: すべてのアカウントの更新中にエラーが発生しました。後でもう一度お試しください。
zh_cn: 刷新全部账户时发生错误，请稍后重试。

# Status.AutoRefreshDoneTitle
source: Auto refresh complete
ja_jp: 自動更新が完了しました
zh_cn: 自动刷新完成

# Status.AutoRefreshFailedTitle
source: Auto refresh failed
ja_jp: 自動更新に失敗しました
zh_cn: 自动刷新失败

# Status.CopyFailedTitle
source: Copy failed
ja_jp: コピーに失敗しました
zh_cn: 复制失败

# Status.CopyNoKeyMessage
source: No saved API key found for this account. Edit the account and save the key.
ja_jp: このアカウントに保存された API キーが見つかりません。アカウントを編集してキーを保存してください。
zh_cn: 未找到该账户保存的 API Key，请重新编辑账户并保存密钥。

# Status.CopiedTitle
source: Copied
ja_jp: コピーしました
zh_cn: 已复制

# Status.CopiedMessage
source: API key copied. A clipboard clear will be attempted after 30 seconds.
ja_jp: API キーをコピーしました。30 秒後にクリップボードからの削除を試みます。
zh_cn: API Key 已复制，30 秒后将尝试从剪贴板清除。

# Status.CopyFailedMessage
source: Failed to copy API key. Please retry.
ja_jp: API キーのコピーに失敗しました。再試行してください。
zh_cn: 复制 API Key 失败，请重试。

# Status.HistoryOpenFailed
source: Failed to open history. Please try again later.
ja_jp: 履歴を開けませんでした。後でもう一度お試しください。
zh_cn: 打开历史记录失败，请稍后重试。

# Card.AutoRefreshOn
source: Auto refresh: on
ja_jp: 自動更新：オン
zh_cn: 自动刷新：已开启

# Card.AutoRefreshOff
source: Auto refresh: off
ja_jp: 自動更新：オフ
zh_cn: 自动刷新：已关闭

# Card.RefreshIntervalFormat
source: Refresh interval: {0} minutes
ja_jp: 更新間隔：{0} 分
zh_cn: 刷新间隔：{0} 分钟

# Card.NextRefreshOff
source: Next refresh: auto refresh off
ja_jp: 次回更新：自動更新オフ
zh_cn: 下次刷新：自动刷新已关闭

# Card.NextRefreshAtFormat
source: Next refresh: {0}
ja_jp: 次回更新：{0}
zh_cn: 下次刷新：{0}

# Card.NextRefreshNever
source: Next refresh: not queried yet
ja_jp: 次回更新：未照会
zh_cn: 下次刷新：尚未查询

# Card.NoBalanceData
source: No balance data yet
ja_jp: 残高データはまだありません
zh_cn: 尚无余额数据

# Card.CredentialModeApiKey
source: API Key
ja_jp: 通常の API キー
zh_cn: 普通 API Key

# Card.NotificationsOn
source: Notifications: on
ja_jp: 通知：オン
zh_cn: 通知：开启

# Card.NotificationsOff
source: Notifications: off
ja_jp: 通知：オフ
zh_cn: 通知：关闭

# Card.NotificationsInherit
source: Notifications: inherit global
ja_jp: 通知：グローバルに従う
zh_cn: 通知：继承全局

# Card.Unavailable
source: Unavailable
ja_jp: 利用不可
zh_cn: 不可用

# Card.NotUpdatedYet
source: Not updated yet
ja_jp: 未更新
zh_cn: 尚未成功更新

# Card.LastSuccessLineFormat
source: Last successful update: {0}
ja_jp: 最終更新成功：{0}
zh_cn: 最近成功更新：{0}

# Card.LastQueryFailed
source: Last query was not successful
ja_jp: 前回の照会は失敗しました
zh_cn: 最近一次查询未成功

# Card.Available
source: Available
ja_jp: 利用可能
zh_cn: 可用

# Card.QueryFailed
source: Query failed.
ja_jp: 照会に失敗しました。
zh_cn: 查询失败。

# Card.BalanceNormal
source: Balance normal
ja_jp: 残高は正常です
zh_cn: 余额正常

# Card.AlertsDisabled
source: Alerts disabled
ja_jp: アラート無効
zh_cn: 未启用提醒

# Card.BelowThresholdFormat
source: {0} below threshold {1}
ja_jp: {0} がしきい値 {1} を下回っています
zh_cn: {0} 低于阈值 {1}

# Card.MetricsBelowThresholdFormat
source: {0} metrics below threshold
ja_jp: {0} 個の指標がしきい値を下回っています
zh_cn: {0} 个指标低于阈值

# Insights.NoData
source: No data
ja_jp: データなし
zh_cn: 尚无数据

# Insights.PerDayFormat
source: {0} / day
ja_jp: {0} / 日
zh_cn: {0} / 天

# Insights.EstimateExplanation
source: Estimated · calculated from local history; actual consumption may differ.
ja_jp: 推定値 · ローカルの履歴に基づいて計算されており、実際の消費量とは異なる場合があります。
zh_cn: 估算值 · 基于本机历史记录计算，实际消耗可能不同。

# Insights.EstimateUnavailableFormat
source: Cannot estimate ({0}).
ja_jp: 推定できません（{0}）。
zh_cn: 不可估算（{0}）。

# Insights.ChartSummaryFormat
source: {0} trend: {1} data points, {2}, minimum {3}, maximum {4}
ja_jp: {0} 傾向：{1} データ点、{2}、最小 {3}、最大 {4}
zh_cn: {0} 趋势：{1} 个数据点，{2}，最低 {3}，最高 {4}

# Insights.ExportCsvFailed
source: Failed to export CSV. Please try again later.
ja_jp: CSV のエクスポートに失敗しました。後でもう一度お試しください。
zh_cn: 导出 CSV 失败，请稍后重试。

# Insights.NonPositiveConsumption
source: Daily consumption is not positive
ja_jp: 1 日あたりの消費量が正ではありません
zh_cn: 日消耗不为正

# Insights.CannotEstimate
source: Cannot estimate
ja_jp: 推定できません
zh_cn: 无法估算

# Dialog.DeleteAccountTitle
source: Delete account
ja_jp: アカウントを削除
zh_cn: 删除账户

# Dialog.DeleteAccountConfirm
source: Delete account "{0}" ({1})?
ja_jp: アカウント「{0}」（{1}）を削除しますか？
zh_cn: 确定要删除账户“{0}”（{1}）吗？

# Dialog.DeleteAccountScope
source: Credentials, balance history, thresholds, notification settings, and active notifications for this account will be deleted.
ja_jp: このアカウントの資格情報、残高履歴、しきい値、通知設定、アクティブな通知が削除されます。
zh_cn: 删除后，该账户的凭据、余额历史、阈值、通知设置与活动通知将一并删除。

# Dialog.DeleteAccountIrreversible
source: This action cannot be undone.
ja_jp: この操作は元に戻せません。
zh_cn: 此操作不可撤销。

# Dialog.HideToTrayTitle
source: Hide to notification area
ja_jp: 通知領域に隠す
zh_cn: 隐藏到通知区域

# Dialog.HideToTrayMessage
source: ApiMonitor will keep running in the notification area. Click the tray icon to reopen, or use the tray menu to exit.
ja_jp: ApiMonitor は通知領域で実行を続けます。トレイアイコンをクリックして再度開くか、トレイメニューから終了できます。
zh_cn: ApiMonitor 将继续在通知区域运行。你可以单击右下角图标重新打开，或从托盘菜单退出。

# Dialog.HideAndRun
source: Hide and keep running
ja_jp: 隠して実行を続ける
zh_cn: 隐藏并继续运行

# Dialog.DontAskAgain
source: Don't ask again
ja_jp: 今後表示しない
zh_cn: 不再提示

# Dialog.RestartTitle
source: Restart app
ja_jp: アプリを再起動
zh_cn: 重启应用

# Dialog.RestartMessage
source: The language change will take effect after the app restarts. Restart now?
ja_jp: 言語の変更はアプリの再起動後に有効になります。今すぐ再起動しますか？
zh_cn: 语言更改将在重启应用后生效。是否立即重启？

# Dialog.EditAccountTitle
source: Edit account
ja_jp: アカウントを編集
zh_cn: 编辑账户

# Dialog.AddAccountTitle
source: Add account
ja_jp: アカウントを追加
zh_cn: 添加账户

# Dialog.TestSuccessTitle
source: Connection succeeded
ja_jp: 接続に成功しました
zh_cn: 连接成功

# Dialog.TestSuccessNoBalance
source: Connection succeeded, but the API returned no balance details.
ja_jp: 接続に成功しましたが、API が残高の詳細を返しませんでした。
zh_cn: 连接成功，但接口未返回余额明细。

# Dialog.TestSuccessSuffix
source: The account and credentials are only saved after you click Save.
ja_jp: 保存をクリックした後にのみアカウントと資格情報が保存されます。
zh_cn: 。点击保存后才会写入账户与凭据。

# Dialog.TestFailedTitle
source: Connection failed
ja_jp: 接続に失敗しました
zh_cn: 连接失败

# Dialog.TestFailedDefault
source: Test connection failed.
ja_jp: テスト接続に失敗しました。
zh_cn: 测试连接失败。

# Dialog.TestUnexpectedError
source: An unexpected error occurred during the test. Please try again later.
ja_jp: テスト中に予期しないエラーが発生しました。後でもう一度お試しください。
zh_cn: 测试连接时发生意外错误，请稍后重试。

# Dialog.ValidationTestPending
source: Test is not finished yet. Please wait.
ja_jp: テストはまだ完了していません。お待ちください。
zh_cn: 测试尚未完成，请稍候。

# Dialog.ValidationNameRequired
source: Please enter an account display name.
ja_jp: アカウントの表示名を入力してください。
zh_cn: 请输入账户显示名称。

# Dialog.ValidationKeyRequired
source: Please enter an API key.
ja_jp: API キーを入力してください。
zh_cn: 请输入 API Key。

# Dialog.ValidationThresholdInvalid
source: Threshold must be a valid number greater than or equal to 0.
ja_jp: しきい値は 0 以上の有効な数値である必要があります。
zh_cn: 阈值金额必须是不小于 0 的有效数字。

# Dialog.ValidationIntervalInvalid
source: Refresh interval is invalid.
ja_jp: 更新間隔が無効です。
zh_cn: 刷新间隔无效。

# Notification.InheritGlobal
source: Inherit global
ja_jp: グローバルに従う
zh_cn: 继承全局

# Notification.NoRepeat
source: No repeat
ja_jp: 繰り返さない
zh_cn: 不重复

# Notification.Hours6
source: 6 hours
ja_jp: 6 時間
zh_cn: 6 小时

# Notification.Hours12
source: 12 hours
ja_jp: 12 時間
zh_cn: 12 小时

# Notification.Hours24
source: 24 hours
ja_jp: 24 時間
zh_cn: 24 小时

# Notification.Days3
source: 3 days
ja_jp: 3 日
zh_cn: 3 天

# Floating.NotQueried
source: Balance not queried yet
ja_jp: 残高はまだ照会されていません

# Floating.NoAccounts
source: No API accounts yet
ja_jp: API アカウントがまだありません

# Floating.QueryFailed
source: Query failed
ja_jp: 照会に失敗しました

# History.Loading
source: Loading history…
ja_jp: 履歴を読み込んでいます…
zh_cn: 正在加载历史记录…

# History.Empty
source: No history to display.
ja_jp: 表示できる履歴はありません。
zh_cn: 没有可显示的历史记录。

# History.ClearFailed
source: Failed to clear history. Please try again later.
ja_jp: 履歴の削除に失敗しました。後でもう一度お試しください。
zh_cn: 清除历史记录失败，请稍后重试。

source: History cleared.
ja_jp: 履歴を削除しました。
zh_cn: 历史记录已清除。

# History.ClearTitle
source: Clear history
ja_jp: 履歴を削除
zh_cn: 清除历史记录

# History.ClearConfirm
source: Clear all balance history for this account? This cannot be undone.
ja_jp: このアカウントのすべての残高履歴を削除しますか？この操作は元に戻せません。
zh_cn: 确定要清除该账户的全部余额历史吗？此操作不可撤销。

# Data.BackupDescription
source: The portable backup contains account metadata, non-sensitive provider settings, balance history, thresholds, and settings; it never contains API keys or credentials.
ja_jp: ポータブルバックアップには、アカウントメタデータ、Provider の非機密設定、残高履歴、しきい値、設定が含まれます。API キーや資格情報は一切含まれません。
zh_cn: 便携备份包含账户元数据、Provider 非敏感设置、余额历史、阈值与设置；不包含 API Key 或凭据。

# Data.ImportPreview
source: Backup can be imported: {0} accounts, {1} history entries;
ja_jp: バックアップをインポートできます：{0} アカウント、{1} 件の履歴；
zh_cn: 备份可导入：{0} 个账户、{1} 条历史；

# Data.ImportPreviewProvider
source: Providers: {0}. Import is a safe merge and contains no API keys.
ja_jp: Provider：{0}。インポートは安全なマージで、API キーは含まれません。
zh_cn: Provider：{0}。导入为安全合并，不包含 API Key。

# Data.ImportDone
source: Import complete: {0} added, {1} updated,
ja_jp: インポート完了：追加 {0}、更新 {1}、
zh_cn: 导入完成：新增 {0}、更新 {1}、

# Data.ImportSkipped
source: {0} skipped, {1} failed;
ja_jp: {0} スキップ、{1} 失敗；
zh_cn: 跳过 {0}、失败 {1}；

# Data.ImportHistory
source: History: {0} added, {1} skipped. {2}
ja_jp: 履歴：{0} 件追加、{1} 件スキップ。{2}
zh_cn: 历史新增 {0} 条、跳过 {1} 条。{2}

# Settings.NotificationLocalOnly
source: Balance alerts are generated locally by ApiMonitor while it is running. After exiting ApiMonitor, no further queries or alerts are sent.
ja_jp: 残高アラートは ApiMonitor の実行中にローカルで生成されます。ApiMonitor を終了すると、以後の照会やアラートは送信されません。
zh_cn: 余额提醒由本机 ApiMonitor 在运行期间生成。退出 ApiMonitor 后不会继续查询或发送新提醒。

# Settings.LanguageSwitchFailed
source: Language switch failed. Please try again later.
ja_jp: 言語の切り替えに失敗しました。後でもう一度お試しください。
zh_cn: 语言切换失败，请稍后重试。

source: Notification sent.
ja_jp: 通知を送信しました。
zh_cn: 通知已发送。

# Notification.SendFailed
source: Unable to send test notification. Please try again later.
ja_jp: テスト通知を送信できませんでした。後でもう一度お試しください。
zh_cn: 无法发送测试通知，请稍后重试。

# Notification.SentDetailed
source: Test notification sent. If it does not appear, check Windows notification settings or Do Not Disturb.
ja_jp: テスト通知を送信しました。表示されない場合は、Windows の通知設定またはおやすみモードを確認してください。
zh_cn: 测试通知已发送。如果未显示，请检查 Windows 通知设置或勿扰模式。

# Notification.SendFailedDetailed
source: Failed to send test notification. Check Windows notification settings.
ja_jp: テスト通知の送信に失敗しました。Windows の通知設定を確認してください。
zh_cn: 测试通知发送失败，请检查 Windows 通知设置。

# Metric.BalanceFormat
source: {0} balance {1}
ja_jp: {0} 残高 {1}
zh_cn: {0} 余额 {1}

# Metric.UnlimitedFormat
source: {0}: unlimited
ja_jp: {0}：無制限
zh_cn: {0}：无限额度

# Metric.TotalFormat
source: Total {0}
ja_jp: 合計 {0}
zh_cn: 总额 {0}

# Metric.GrantedFormat
source: Granted {0}
ja_jp: 付与 {0}
zh_cn: 赠送 {0}

# Metric.ToppedUpFormat
source: Top-up {0}
ja_jp: チャージ {0}
zh_cn: 充值 {0}

# Metric.CumulativeTopUpFormat
source: Total top-ups {0}
ja_jp: 累計チャージ {0}
zh_cn: 累计充值 {0}

# Metric.CumulativeUsedFormat
source: Total used {0}
ja_jp: 累計使用 {0}
zh_cn: 累计使用 {0}

# Metric.LimitFormat
source: / limit {0}
ja_jp: / 上限 {0}
zh_cn: / 上限 {0}

# Metric.UsedFormat
source: · used {0}
ja_jp: · 使用 {0}
zh_cn: · 已用 {0}

# Metric.BelowThresholdFormat
source: {0}, below threshold {1}
ja_jp: {0}、しきい値 {1} を下回っています
zh_cn: {0}，已低于阈值 {1}

# Metric.RecoveredFormat
source: {0} balance recovered to {1}
ja_jp: {0} 残高は {1} に回復しました
zh_cn: {0} 余额已恢复至 {1}

# Metric.RecoveredGenericFormat
source: {0} recovered to {1}
ja_jp: {0} は {1} に回復しました
zh_cn: {0} 已恢复至 {1}

# Tray.Refreshing
source: Refreshing
ja_jp: 更新中
zh_cn: 正在刷新

# Tray.RecentFailure
source: Last refresh failed
ja_jp: 前回の更新は失敗しました
zh_cn: 最近刷新失败

# Tray.AutoRefreshRunning
source: Auto refresh: running
ja_jp: 自動更新：実行中
zh_cn: 自动刷新：运行中

# Tray.AutoRefreshStopped
source: Auto refresh: off
ja_jp: 自動更新：オフ
zh_cn: 自动刷新：已关闭

# Tray.LowBalanceNormal
source: Low balance: normal
ja_jp: 残高不足：正常
zh_cn: 低余额：正常

# Tray.LowBalanceUnknown
source: Low balance: unknown
ja_jp: 残高不足：不明
zh_cn: 低余额：未知

# Tray.LowBalanceCountFormat
source: Low balance: {0}
ja_jp: 残高不足：{0} 件
zh_cn: 低余额：{0} 项

# Tray.MetricsBelowThresholdFormat
source: {0} metrics below threshold
ja_jp: {0} 個の指標がしきい値を下回っています
zh_cn: {0} 个指标低于阈值

# Tray.ResidencyEnabled
source: The notification area icon is enabled. After hiding to the notification area, auto refresh keeps running. Only "Exit ApiMonitor" fully quits the app.
ja_jp: 通知領域アイコンが有効です。通知領域に隠した後も自動更新は継続します。「ApiMonitor を終了」を選んだ場合のみアプリは完全に終了します。
zh_cn: 通知区域图标已启用。隐藏到通知区域后，余额自动刷新将继续运行。选择“退出 ApiMonitor”后才会完全结束程序。

# Tray.StartupDisabledByUser
source: Sign-in startup was turned off in the Windows startup apps settings. It can be re-enabled in the app.
ja_jp: サインイン時の起動は Windows のスタートアップアプリ設定で無効にされています。アプリ内で再度有効にできます。
zh_cn: 登录启动已被你在 Windows 启动应用设置中关闭。可在应用内重新开启。

# Tray.StartupDisabledByPolicy
source: Sign-in startup is restricted by organization policy and cannot be enabled in the app.
ja_jp: サインイン時の起動は組織のポリシーで制限されており、アプリ内では有効にできません。
zh_cn: 登录启动已被组织策略限制，无法在应用内开启。

# Tray.StartupEnabledByPolicy
source: Sign-in startup is enabled by system policy.
ja_jp: サインイン時の起動はシステムポリシーで有効になっています。
zh_cn: 登录启动由系统策略启用。

# Settings.EnableNotificationsOnContent
source: On
ja_jp: オン
zh_cn: 开启

# Settings.EnableNotificationsOffContent
source: Off
ja_jp: オフ
zh_cn: 关闭

# Settings.RecoveryNotificationsOnContent
source: On
ja_jp: オン
zh_cn: 开启

# Settings.RecoveryNotificationsOffContent
source: Off
ja_jp: オフ
zh_cn: 关闭

# Settings.SendTestNotificationContent
source: Send test notification
ja_jp: テスト通知を送信
zh_cn: 发送测试通知

# Settings.OpenNotificationSettingsContent
source: Open Windows notification settings
ja_jp: Windows の通知設定を開く
zh_cn: 打开 Windows 通知设置

# Settings.StartWithWindowsHeader
source: Start ApiMonitor when I sign in to Windows
ja_jp: Windows へのサインイン時に ApiMonitor を起動
zh_cn: 登录 Windows 时启动 ApiMonitor

# Floating.Unknown
source: Unknown
ja_jp: 不明

# Floating.NoSelectedAccount
source: No account selected
ja_jp: アカウントが選択されていません

# Floating.LastUpdatedFormat
source: Last updated: {0}
ja_jp: 最終更新：{0}

# Dialog.AccountName
source: Account display name
ja_jp: アカウント表示名
zh_cn: 账户显示名称

# Dialog.AccountNamePlaceholder
source: e.g. My DeepSeek account
ja_jp: 例：マイ DeepSeek アカウント
zh_cn: 例如：我的 DeepSeek 账户

# Dialog.AccountNotification
source: Account notifications
ja_jp: このアカウントの通知
zh_cn: 该账户通知

# Dialog.AutoRefresh
source: Auto refresh
ja_jp: 自動更新
zh_cn: 自动刷新

# Dialog.CredentialHint
source: Credential saved: leave empty to keep the existing API key.
ja_jp: 資格情報は保存済みです。空のままにすると既存の API キーを維持します。
zh_cn: 已保存凭据：留空则继续使用现有 API Key。

# Dialog.CredentialMode
source: Credential mode
ja_jp: 資格情報モード
zh_cn: 凭据模式

# Dialog.CredentialModeChanged
source: Credential mode changed. Re-test the connection before saving.
ja_jp: 資格情報モードが変更されました。保存する前に接続を再テストしてください。
zh_cn: 凭据模式已更改，请重新测试连接后才能保存。

# Dialog.NotificationTitle
source: Notification settings
ja_jp: 通知設定
zh_cn: 通知设置

# Dialog.RecoveryNotifications
source: Balance recovery notifications
ja_jp: 残高回復通知
zh_cn: 余额恢复提醒

# Dialog.RefreshInterval
source: Refresh interval
ja_jp: 更新間隔
zh_cn: 刷新间隔

# Dialog.RefreshIntervalHint
source: Auto refresh runs only while the app is running. Monitoring stops when the app is closed.
ja_jp: 自動更新はアプリの実行中のみ行われます。アプリを閉じると監視は停止します。
zh_cn: 当前版本仅在应用正在运行时自动刷新。关闭应用后将停止监测。

# Dialog.RepeatInterval
source: Repeat alert interval
ja_jp: 繰り返しアラート間隔
zh_cn: 重复提醒间隔

# Dialog.ThresholdEmpty
source: No balance data yet. Save the account and complete a first balance query, or use "Test connection" to set low-balance thresholds per metric.
ja_jp: 残高データはまだありません。アカウントを保存して最初の残高照会を完了するか、「接続テスト」で残高を取得すると、指標ごとの残高不足しきい値を設定できます。
zh_cn: 暂无余额数据。保存账户并完成首次余额查询，或点击“测试连接”获取余额后，可在此设置各指标低余额阈值。

# Dialog.ThresholdTitle
source: Low-balance thresholds
ja_jp: 残高不足しきい値
zh_cn: 低余额阈值

# Update.NotFound404
source: No release information found (404).
ja_jp: リリース情報が見つかりません（404）。
zh_cn: 未找到发布信息（404）。

# Update.Forbidden403
source: Access restricted (403, possibly rate limited).
ja_jp: アクセスが制限されています（403、レート制限の可能性）。
zh_cn: 访问被限制（403，可能是速率限制）。

# Update.IncompleteData
source: Release information is incomplete.
ja_jp: リリース情報が不完全です。
zh_cn: 发布信息不完整。

# Update.Timeout
source: Check timed out (15 seconds).
ja_jp: 確認がタイムアウトしました（15 秒）。
zh_cn: 检查超时（15 秒）。

# Update.NetworkError
source: Network error: {0}
ja_jp: ネットワークエラー：{0}
zh_cn: 网络错误：{0}

# History.DialogTitle
source: Balance history
ja_jp: 残高履歴
zh_cn: 余额历史

# History.EmptyDetailed
source: No history yet. Successful manual or automatic queries will appear here.
ja_jp: 履歴はまだありません。成功した手動または自動の照会がここに表示されます。
zh_cn: 暂无历史记录。成功的手动或自动查询会在此显示。

# History.ClearConfirmDetailed
source: Clear all history for this account? The account, key, and current balance are not affected.
ja_jp: このアカウントのすべての履歴を削除しますか？アカウント、キー、現在の残高には影響しません。
zh_cn: 确定清除该账户全部历史记录？不会删除账户、密钥或当前余额。

# About.DocReadFailed
source: Unable to read the local document.
ja_jp: ローカルドキュメントを読み取れません。
zh_cn: 无法读取本地文档。

# About.DocNotFound
source: Local document not found.
ja_jp: ローカルドキュメントが見つかりません。
zh_cn: 本地文档未找到。

# Notification.MoreBelowThreshold
source: {0} more metrics below threshold
ja_jp: 他 {0} 件の指標がしきい値を下回っています
zh_cn: 另有 {0} 项余额低于阈值

# Threshold.CurrentBalanceFormat
source: Current balance: {0}
ja_jp: 現在の残高：{0}
zh_cn: 当前余额：{0}

# Threshold.StatusFormat
source: Status: {0}
ja_jp: 状態：{0}
zh_cn: 状态：{0}

# Threshold.InvalidAmount
source: Invalid amount
ja_jp: 無効な金額
zh_cn: 无效金额

# Threshold.BelowFormat
source: Below threshold {0}
ja_jp: しきい値 {0} を下回っています
zh_cn: 低于阈值 {0}

# Provider.OpenRouterDescription
source: Supports regular API Key (key quota and period usage) and Management Key (account Credits).
ja_jp: 通常の API キー（キー割当てと期間使用量）と Management キー（アカウントの Credits）に対応しています。
zh_cn: 支持普通 API Key（查询密钥剩余额度与周期使用量）与 Management Key（查询账户总 Credits）。

# Provider.OpenRouterApiKeyMode
source: API Key
ja_jp: 通常の API キー
zh_cn: 普通 API Key

# Provider.OpenRouterApiKeyHint
source: Queries only this key remaining quota and usage; it does not read account Credits.
ja_jp: このキーの残り割当てと使用量のみを照会し、アカウントの Credits は読み取りません。
zh_cn: 只查询该密钥的剩余额度与使用量，不读取账户总 Credits。

# Provider.OpenRouterMgmtHint
source: Higher privilege than a regular API Key; use only when querying account Credits. Keys stay in the Windows Credential Locker.
ja_jp: 通常の API キーより権限が高く、アカウントの Credits を照会する場合のみ使用します。キーは Windows Credential Locker にのみ保存されます。
zh_cn: 权限高于普通 API Key，仅在需要查询账户总 Credits 时使用。密钥仍只保存在 Windows Credential Locker。

# Provider.OpenRouterKeyInputHint
source: sk-or-… (regular key) or sk-or-v1-… (Management key)
ja_jp: sk-or-…（通常キー）または sk-or-v1-…（Management キー）
zh_cn: sk-or-…（普通 Key）或 sk-or-v1-…（Management Key）

# Provider.DeepSeekDescription
source: Queries the total balance of each currency in a DeepSeek account (CNY/USD, etc.).
ja_jp: DeepSeek アカウントの各通貨の総残高（CNY/USD など）を照会します。
zh_cn: 查询 DeepSeek 账户各币种总余额（CNY/USD 等）。

# Provider.DeepSeekKeyHint
source: DeepSeek platform API key (sk-…) used only to call the official balance API.
ja_jp: DeepSeek プラットフォームの API キー（sk-…）で、公式の残高 API の呼び出しにのみ使用します。
zh_cn: DeepSeek 平台 API Key，形如 sk-…，仅用于请求官方余额接口。

# Provider.ErrorNoKey
source: No API key provided.
ja_jp: API キーが指定されていません。
zh_cn: 未提供 API Key。

# Provider.ErrorTimeout
source: Request timed out (15 seconds). Please try again later.
ja_jp: リクエストがタイムアウトしました（15 秒）。後でもう一度お試しください。
zh_cn: 请求超时（15 秒），请稍后重试。

# Provider.ErrorNetwork
source: Unable to reach the OpenRouter service. Check network or DNS.
ja_jp: OpenRouter サービスに接続できません。ネットワークまたは DNS を確認してください。
zh_cn: 无法连接 OpenRouter 服务，请检查网络或 DNS。

# Provider.ErrorNetworkDeepSeek
source: Unable to reach the DeepSeek service. Check network or DNS.
ja_jp: DeepSeek サービスに接続できません。ネットワークまたは DNS を確認してください。
zh_cn: 无法连接 DeepSeek 服务，请检查网络或 DNS。

# Provider.ErrorUnexpected
source: An unexpected error occurred during the query. Please try again later.
ja_jp: 照会中に予期しないエラーが発生しました。後でもう一度お試しください。
zh_cn: 查询时发生意外错误，请稍后重试。

# Provider.Error401
source: API key is invalid or expired (401).
ja_jp: API キーが無効または期限切れです（401）。
zh_cn: API Key 无效或已过期（401）。

# Provider.Error402
source: Insufficient account balance or payment required (402).
ja_jp: アカウント残高が不足しているか、支払いが必要です（402）。
zh_cn: 账户余额不足或需要付款（402）。

# Provider.Error403Credits
source: Access denied (403): a regular API key cannot query account Credits. Use a Management key.
ja_jp: アクセスが拒否されました（403）：通常の API キーではアカウントの Credits を照会できません。Management キーを使用してください。
zh_cn: 访问被拒绝（403）：普通 API Key 无法查询账户 Credits，请使用 Management Key。

# Provider.Error403
source: Access denied (403). Check key permissions.
ja_jp: アクセスが拒否されました（403）。キーの権限を確認してください。
zh_cn: 访问被拒绝（403），请检查密钥权限。

# Provider.Error403DeepSeek
source: Access denied (403). Check account permissions.
ja_jp: アクセスが拒否されました（403）。アカウントの権限を確認してください。
zh_cn: 访问被拒绝（403），请检查账户权限。

# Provider.Error429
source: Too many requests (429). Please try again later.
ja_jp: リクエストが多すぎます（429）。後でもう一度お試しください。
zh_cn: 请求过于频繁（429），请稍后重试。

# Provider.ErrorServiceUnavailable
source: {0} service temporarily unavailable (HTTP {1}).
ja_jp: {0} サービスは一時的に利用できません（HTTP {1}）。
zh_cn: {0} 服务暂时不可用（HTTP {1}）。

# Provider.ErrorUnexpectedStatus
source: The service returned an unexpected HTTP status code {0}.
ja_jp: サービスが予期しない HTTP ステータスコード {0} を返しました。
zh_cn: 服务返回了意外的 HTTP 状态码 {0}。

# Provider.ErrorEmptyContent
source: The API returned empty content.
ja_jp: API が空のコンテンツを返しました。
zh_cn: 接口返回了空内容。

# Provider.ErrorInvalidJson
source: The API returned JSON that could not be parsed.
ja_jp: API が解析できない JSON を返しました。
zh_cn: 接口返回的 JSON 格式无法解析。

# Provider.ErrorMissingData
source: The API response is missing the data field.
ja_jp: API レスポンスに data フィールドがありません。
zh_cn: 接口响应缺少 data 字段。

# Backup.ErrorTooManyEntries
source: Backup contains too many entries.
ja_jp: バックアップのエントリ数が上限を超えています。
zh_cn: 备份条目数量超出上限。

# Backup.ErrorPathEntry
source: Backup contains a path entry: {0}
ja_jp: バックアップにサブディレクトリまたはパスエントリが含まれています：{0}
zh_cn: 备份包含子目录或路径条目：{0}

# Backup.ErrorInvalidFileName
source: Backup contains an invalid file name: {0}
ja_jp: バックアップに不正なファイル名が含まれています：{0}
zh_cn: 备份包含非法文件名：{0}

# Backup.ErrorFileTooLarge
source: Backup file exceeds the size limit: {0}
ja_jp: バックアップの単一ファイルがサイズ上限を超えています：{0}
zh_cn: 备份单文件超出大小上限：{0}
